#Задача 3
m = int(input("Введите целое число m (> 1) : "))
k = m // 4
print (f"Наибольшее целое k, при котором 4k < {m}, равно {k}")



